In [1]:
import pymssql
import json
import pandas as pd

server = '0.0.0.0'
port = 1433
user = 'SA'
password = 'SRIBD@luohucct0'

dbname = 'medicine'

In [2]:
conn = pymssql.connect(server, user, password, dbname, port = 1433)

In [3]:
pd.read_sql('select name from sys.Tables', conn)

                    name
0             MD00000001
1  T_MediPatientInfo_new
2              xml_table

In [4]:
df = pd.read_sql('select * from xml_table', conn)
#df.to_json('data/xml_table.json', orient = 'split')
df.head()

,Id,RecipeID,PatientID,JobNumber,RegiNumber,JobOrgan_Id,DataType,Data
0,1,150,79600,2900324,0000771205,1,2,<Request><Sex>男</Sex><Age>21岁</Age><InAdmDate>...
1,2,150,79600,2900324,0000771205,1,3,<Request><HisID/><Sex>男</Sex><Age>21岁</Age><In...
2,4,624,74516,4310343,0000150051,1,2,<Request><Sex>男</Sex><Age>74岁</Age><InAdmDate>...
3,5,624,74516,4310343,0000150051,1,3,<Request><HisID/><Sex>男</Sex><Age>74岁</Age><In...
4,6,624,74516,4310343,0000150051,1,4,<Request><TempItemInfo><TempItemInfo><OEORDRow...

In [7]:
root = '/home/floyd/Desktop/luohudb/'

df.to_pickle(root + 'data/' + 'xml.p')